{
    "skills_acquired": "AI, Python, Deep Learning, Machine Learning, C++, Linux, Beautiful Soup, CNN, Datalab, GANs, GitHub, Google Colab, Jupyter, Kaggle, Keras, LSTM, Librosa, Matplotlib, MySQL, NumPy, OpenCV, PIL, Pandas, PostgreSQL, PySpark, Pytorch, RNN, Regex, SQL, Seaborn, Tensorflow, NLTK, Scikit-learn, API, Amazon Web Services (AWS), Cognitive Computing, Elastic Search, Google Cloud, Graph Database, IBM BlueMix, Microsoft Azure, NoSQL, RDBMS, Apache Solr",
    "skills_to_learn": "AI, Python, Deep Learning, Machine Learning, C++, Linux, Beautiful Soup, CNN, Datalab, GANs, GitHub, Google Colab, Jupyter, Kaggle, Keras, LSTM, Librosa, Matplotlib, NumPy, OpenCV, PIL, Pandas, PySpark, Pytorch, RNN, Regex, Seaborn, Tensorflow, NLTK, Scikit-learn, API, Amazon Web Services (AWS), Cognitive Computing, Elastic Search, Google Cloud, Graph Database, IBM BlueMix, Microsoft Azure, NoSQL, RDBMS, Apache Solr",
    "courses_online": {
        "status": 200,
        "message": "PASS",
        "Course": [
            {
                "courseID": "COURSE_398",
                "courseTitle": "IBM Applied AI Professional Certificate",
                "Tech_Skill": "AI, API, Deep Learning, Machine Learning, NumPy, OpenCV, Pandas, Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "OpenCV, IBM Watson Studio, AI, Python, API, Deep Learning, Pandas, NumPy, Machine Learning, Neural Network, APIs",
                "outcomeLearning": "Understand the definition of AI, its applications and use cases, and explain terms like machine learning, deep learning, and neural networks. Create AI chatbots and virtual assistants without any programming and deploy them on a website. Build AI-powered solutions using IBM Watson AI services, APIs, and Python with minimal coding. Apply computer vision techniques using Python, OpenCV, & Watson and develop custom image classification models and deploy them to the Cloud.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/applied-artifical-intelligence-ibm-watson-ai",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Korean",
                "rating": "4.6",
                "peopleRating": "4548",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_391",
                "courseTitle": "IBM Data Analyst Professional Certificate",
                "Tech_Skill": "Amazon Web Services (AWS)JupyterMatplotlib",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Pivot, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Coursera",
                "duration": "9:00:00",
                "feeVND": "414166.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_431",
                "courseTitle": "Introduction to Data Analytics",
                "Tech_Skill": "JupyterMicrosoft AzureScikit-learn",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Jupyter, Microsoft Azure, Machine Learning, Scikit-learn, Python, API, Microsoft Azure",
                "outcomeLearning": "This course presents a gentle introduction into the concepts of data analysis, the role of a Data Analyst, and the tools that are used to perform daily functions. You will gain an understanding of the data ecosystem and the fundamentals of data analysis, such as data gathering or data mining. You will then learn the soft skills that are required to effectively communicate your data to stakeholders, and how mastering these skills can give you the option to become a data driven decision maker. This course will help you to differentiate between the roles of a Data Analyst, Data Scientist, and Data Engineer. You will learn the responsibilities of a Data Analyst and exactly what data analysis entails. You will be able to summarize the data ecosystem, such as databases and data warehouses. You will then uncover the major vendors within the data ecosystem and explore the various tools on-premise and in the cloud. Continue this exciting journey and discover Big Data platforms such as Hadoop, Hive, and Spark. By the end of this course you will be able to visualize the daily life of a Data Analyst, understand the different career paths that are available for data analytics, and identify the many resources available for mastering this profession. Throughout this course you will learn the key aspects to data analysis. You will begin to explore the fundamentals of gathering data, and learning how to identify your data sources. You will then learn how to clean, analyze, and share your data with the use of visualizations and dashboard tools. This all comes together in the final project where it will test your knowledge of the course material, explore what it means to be a Data Analyst, and provide a real-world scenario of data analysis. This course does not require any prior data analysis, spreadsheet, or computer science experience. All you need to get started is basic computer literacy, high school level math, and access to a modern web browser such as Chrome or Firefox.",
                "provider": "Coursera",
                "duration": "11:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/learn/introduction-to-data-analytics",
                "language": "Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, English, Spanish",
                "rating": "4.8",
                "peopleRating": "3632",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_250",
                "courseTitle": "Full-Stack Software Engineer",
                "Tech_Skill": "GitHubGraph Database",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "JavaScript, PostgreSQL, SQL, API, Node.js, JavaScript, GitHub, Git, TDD, Redux, Express.js, React, CSS, Graph Database, RESTful API, HTML, APIs, Search Algorithm, Neo4J",
                "outcomeLearning": "Welcome to the Full-Stack engineer path. Getting Started with Full-Stack Engineering. Introduction to software engineering. Setting Up Your Dev Environment. Learn about the field of web development and the tools developers use to create websites. JavaScript Syntax, Part I. Get introduced to JavaScript and get comfortable with the basics of writing JavaScript programs. JavaScript Syntax, Part II. Discover more JavaScript techniques and features including arrays, looping, and objects. Git and Github, Part I. Learn how to use the Git version control system to keep track of changes and document your work. Then learn markdown and publish your first. JavaScript Syntax Portfolio Project. Build a Node.js console app that generates random messages each time a user runs the program and version your project with Git/GitHub. Web Development Fundamentals. Be introduced to the field of front-end web development and create your first web page on the internet. Bringing Your Site Online. Learn about different methods for hosting your site, like GitHub pages and how to use a custom domain name. Improved Styling with CSS. Dig deeper into CSS and improve your ability to layout and style websites. Building Interactive Websites with JavaScript. Understand how JavaScript is used to add interactive experiences to a website. Making a Website Responsive. Learn how to create websites that can be viewed on a variety of devices and use different layouts and positioning. Making a Website Accessible. Refactor your website to follow the best accessibility (a11y) practices. HTML, CSS, and JS Portfolio Project. Bring together what you have learned in the previous lessons and build a project off of Codecademy. JavaScript Syntax, Part III. Understand intermediate JavaScript concepts, such as classes, modules, and error handling. Test Driven Development with JavaScript. Be introduced to the fundamentals of Test Driven Development (TDD). Async JavaScript and HTTP Requests. Learn about APIs (Application Programming Interfaces). Working with APIs will enable you to work with data stored on remote servers. Web Apps. Be introduced to web applications and learn about single page applications (SPAs) and how they are different from static websites. React, Part I. Be introduced to the popular JavaScript library, React. React, Part II. Dive further into React and learn about props, state, hooks as well as testing with Jest and Enzyme. Learn Redux, the library most commonly used with React to manage application state. Git and GitHub, Part II. Learn how to use Git and GitHub to collaborate efficiently with developers. React and Redux Portfolio Project. Bring together what you have learned in the previous lessons and build a project off of Codecademy. Basics of Back-End Development. Start learning about back-end development and programming servers. Build a Back-End with Node/Express.js. Learn about the popular back-end environment, Node.js and how to create back-end servers and APIs in JavaScript using the popular Express.js. Back-End and Feature Testing. Learn about TDD techniques for full-stack web applications. SQL for Back-End Development. Learn how to create tables, create, retrieve, and update data in SQL databases, and build a data-intensive web app. PostgreSQL Database. Much of the internet is the flow of information. Learn how databases store data so that it can be displayed on the web using PostgreSQL. Designing Relational Databases. Learn how to design relational databases that you can then implement in PostgreSQL. advanced PostgreSQL. Learn about database performance and techniques for efficiently accessing data and maintaining optimal performance. Back-End Portfolio Project. Build an e-commerce REST API using Node/Express and PostgreSQL. Connecting Front-End to Back-End. Learn about the different ways to combine your front-end and back-end systems to create a cohesive full-stack application. Adding a PostgreSQL Database. Learn PostgreSQL to connect JS and SQL in web apps, and build your first fully-integrated app back-end. Security, Authentication, and Authorization. Learn how to make a web application secure. Advanced Concepts in TDD. Learn advanced Test Driven Development (TDD) concepts that will help to test your web application as a whole. Full-Stack Portfolio Project. Expand the e-commerce REST API with a React client app, creating a PERN (Postgres, Express, React, Node) full-stack e-commerce experience. Linear Data Structures. Begin interview preparation by learning the fundamentals of linear data structures. Complex Data Structures. Continue interview preparation by learning advanced applications of data structures. Continue interview preparation by learning the fundamentals of algorithms. Search & Graph Search Algorithms. Continue interview preparation by learning the fundamentals of search algorithms. Interview Skills. Review some key technical interview topics as well as soft skills which employers are looking for in potential candidates. Final Portfolio Project. Build a PERN app of your choosing and deploy it to Heroku.",
                "provider": "Codecademy",
                "duration": "1:52:00",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/full-stack-engineer-career-path",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_403",
                "courseTitle": "Cloud Application Development Foundations Specialization",
                "Tech_Skill": "GitHub, NoSQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Node.js, Cloud Native, React, GitHub, CSS, NoSQL, HTML, JavaScript, SQL, CI/CD, Azure DevOps, Cloud Computing, IaaS, PAAS, SAAS",
                "outcomeLearning": "Define cloud computing and explain its essential characteristics, models, benefits, infrastructure, & emerging trends. Create a cloud account. Develop with front-end development languages and tools such as HTML, CSS, Javascript and React. Program applications with back-end development languages and tools such as Node.js  and NoSQL databases. Build and deploy applications using Cloud Native methodologies and tools, CI/CD toolchains, and build your portfolio using GitHub",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/ibm-cloud-application-development-foundations",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "108",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_394",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization",
                "Tech_Skill": "GitHubJupyter",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Statistics, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Coursera",
                "duration": "2 months",
                "feeVND": "20616200.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_395",
                "courseTitle": "IBM Data Analytics with Excel and R Professional Certificate",
                "Tech_Skill": "Jupyter, RDBMS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, R Studio, Jupyter, RDBMS, SQL, Microsoft Excel, Pivot, Cognos, Spreadsheet, R Shiny",
                "outcomeLearning": "Manipulate numeric and textual data types using the R programming language and RStudio or Jupyter Notebooks. Define and manipulate R data structures, including vectors, factors, lists, and data frames. Control program flow, define functions, perform character string and date operations, define regular expressions, and handle errors. Read, write, and save data files and scrape web pages using R.",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst-r-excel",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.8",
                "peopleRating": "270",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_406",
                "courseTitle": "AWS Fundamentals Specialization",
                "Tech_Skill": "Amazon Web Services (AWS), Google Cloud",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "REST, Amazon Web Services (AWS), Amazon GuardDuty, Amazon CloudTrail, AWS Security Hub, Google Cloud, AWS Lambda, Amazon Lex",
                "outcomeLearning": "You will be able to make an informed decision about when and how to apply key AWS services for compute, storage, and database to different use cases. Foundational security concepts, including basic concepts such as \"least privilege\" and the \"Shared Responsibility Model\". Detective controls, including Amazon CloudTrail, AWS Security Hub, Amazon GuardDuty, and AWS Config. Encryption of data at rest, in motion, and best practices for how to store data within and between various AWS services.",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/aws-fundamentals",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Korean",
                "rating": "4.6",
                "peopleRating": "9516",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_434",
                "courseTitle": "Data Engineering Foundations Specialization",
                "Tech_Skill": "NoSQLRDBMS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "MySQL, ETL, NumPy, SQL, PostgreSQL, IBM Db2, API, Python, Pandas, RDBMS, DBMS, NoSQL, NumPy, Web Scraping",
                "outcomeLearning": "Working knowledge of Data Engineering Ecosystem and Lifecycle. Viewpoints and tips from Data professionals on starting a career in this domain. Relational Database fundamentals including Database Design, Creating Schemas, Tables, Constraints, and working with MySQL, PostgreSQL & IBM Db2. Python programming basics including data structures, logic, working with files, invoking APIs, using libraries such as Pandas and Numpy, doing ETL. SQL query language, SELECT, INSERT, UPDATE, DELETE statements, database functions, stored procs, working with multiple tables, JOINs, & transactions.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-engineering-foundations",
                "language": "English",
                "rating": "4.7",
                "peopleRating": "380",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_400",
                "courseTitle": "Data Science: Foundations using R Specialization",
                "Tech_Skill": "GitHubRegex",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R Studio, R, GitHub, Machine Learning, DML, Regex",
                "outcomeLearning": "Use R to clean, analyze, and visualize data. Learn how to ask the right questions, obtain data, and perform reproducible research. Use GitHub to manage data science projects. Set up R, R-Studio, Github and other useful tools",
                "provider": "Coursera",
                "duration": "16:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-science-foundations-r",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "5167",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_368",
                "courseTitle": "Data Manipulation with pandas",
                "Tech_Skill": "Pandas, Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Python, Pandas",
                "outcomeLearning": "pandas is the world's most popular Python library, used for everything from data manipulation to data analysis. In this course, you'll learn how to manipulate dataframes, as you extract, filter, and transform real-world datasets for analysis. Using pandas you'll explore all the core data science concepts. Using real-world data, including Walmart sales figures and global temperature time series, you'll learn how to import, clean, calculate statistics, and create visualizations—using pandas to add to the power of Python!",
                "provider": "Datacamp",
                "duration": "4:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/data-manipulation-with-pandas",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_358",
                "courseTitle": "Introduction to Google Colaboratory with Python",
                "Tech_Skill": "Linux",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Tmux, Git, CSysdig, iproute2, DNS, SSH, Windows, SOCKS, IPTables, Linux",
                "outcomeLearning": "Google Colaboratory is a Google cloud-based service that replicates Jupyter Notebook in the cloud. You don't have to install anything on your system to use it. In most respects, you use Colaboratory as you would a desktop installation of Jupyter Notebook. Google Colaboratory is primarily for those readers who use something other than a standard desktop setup to work.\nYou'll learn about the all features of Google Colaboratory.\nThe course is for you if you're a newcomer to Data Science and Python programming. Google recently update their Google Colabortatory in January 2020. This course is totally on the new version of Google Colaboratory",
                "provider": "Udemy",
                "duration": "09:01:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/introduction-to-google-colaboratory-with-python/",
                "language": "English",
                "rating": "4.4",
                "peopleRating": "544",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_236",
                "courseTitle": "Computer Science",
                "Tech_Skill": "Graph Database",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Python, Data Structures, Graph Database, Command Line, Git, PostgreSQL",
                "outcomeLearning": "Introduction to Programming. Kickstart your coding life as you learn all about the programming language Python and the techniques used when writing it. Development Skills. Learn about the tools for software development. Learn to navigate the terminal and keep snapshots of your work using git. Flow, Data, and iteration. Learn all about control flow, storage of data in Python, and how to loop over things. Build a Tourism Recommendation Engine. Develop your own application using the Python programming language, the terminal, and git! Use your coding skills to make a tourism recommendation service. Python Objects. Learn about creating and using objects in Python with these courses on some of the most commonly used data types. Then unlock your full potential by learning how to create your own with classes. Create an Art Marketplace. Learn about building and creating data types and objects in this course that focuses on creating a specialized marketplace for art traders. Linear Data Structures. Learn about virtualization of computer memory by building the fundamental data structures of computer science: lists, stacks, and queues. Learn Complex Data Structures. Discover and design new data structures that follow abstract rule-based systems by building out graphs, hash-maps, and heaps. Data Structures Review. After learning about data structures, take some time to review and compare them. Asymptotic Notation. Learn how to analyze performance of algorithms in a general way using asymptotic notation. Learn Recursion with Python. Recursion gives you a new perspective on problem-solving by defining a problem in terms of itself. Learn Sorting Algorithms with Python. Learn about the usefulness and efficiency of computational sorting by implementing different sorting algorithms yourself. How to Implement Search Algorithms with Python. Finding the data you are looking for in a data set is an important skill: get started with two common approaches. Graph Search Algorithms. Learn how to explore and graph the information you are looking for.",
                "provider": "Codecademy",
                "duration": "16:00:00",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/computer-science",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_388",
                "courseTitle": "Coding for Everyone: C and C++ Specialization",
                "Tech_Skill": "C++",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Graph Theory, STL, C++, C",
                "outcomeLearning": "This Specialization is intended for all programming enthusiasts, as well as beginners, computer and other scientists, and artificial intelligence enthusiasts seeking to develop their programming skills in the foundational languages of C and C++. Through the four courses — two in C, and two in C++ — you will cover the basics of programming in C and move on to the more advanced C++ semantics and syntax, which will prepare you to apply these skills to a number of higher-level problems using AI algorithms and Monte Carlo evaluation in complex games.",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/coding-for-everyone",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.4",
                "peopleRating": "1223",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_357",
                "courseTitle": "Launch Your Salesforce Career: Newbie to Paid Professional",
                "Tech_Skill": "Linux",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Bash, Shell, Linux, Scripting",
                "outcomeLearning": "You'll learn the essential basics to Salesforce from no knowledge to paid expert knowledge.\nYou'll learn how to land your first Salesforce admin job right out of the gates. You'll master admin skills that will have you ready and prepared for your first Salesforce administrator job. You'll gain a deep understanding of the direction you can take your Salesforce career.",
                "provider": "Udemy",
                "duration": "11:21:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/how-to-get-a-salesforce-job/",
                "language": "English",
                "rating": "4.4",
                "peopleRating": "0",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_367",
                "courseTitle": "Introduction to Tableau",
                "Tech_Skill": "Scikit-learn",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Logistic Regression, Machine Learning, SVM, Scikit-learn, Python",
                "outcomeLearning": "Tableau is a widely used business intelligence (BI) and analytics software trusted by companies like Amazon, Experian, and Unilever to explore, visualize, and securely share data in the form of Workbooks and Dashboards. With its user-friendly drag-and-drop functionality it can be used by everyone to quickly clean, analyze, and visualize your team's data. You'll learn how to navigate Tableau's interface and connect and present data using easy-to-understand visualizations. By the end of this training, you'll have the skills you need to confidently explore Tableau and build impactful data dashboards. Let's dive in.",
                "provider": "Datacamp",
                "duration": "6:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-tableau",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_379",
                "courseTitle": "Introduction to PySpark",
                "Tech_Skill": "PySpark",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "PySpark, Python, Apache Spark",
                "outcomeLearning": "In this course, you'll learn how to use Spark from Python! Spark is a tool for doing parallel computation with large datasets and it integrates well with Python. PySpark is the Python package that makes the magic happen. You'll use this package to work with data about flights from Portland and Seattle. You'll learn to wrangle this data and build a whole machine learning pipeline to predict whether or not flights will be delayed. Get ready to put some Spark in your Python code and dive into the world of high-performance machine learning!",
                "provider": "Datacamp",
                "duration": "4:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-pyspark",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_371",
                "courseTitle": "Cloud Computing for Everyone",
                "Tech_Skill": "Microsoft Azure",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Salesforce, Microsoft Azure, Amazon Web Services (AWS)",
                "outcomeLearning": "Every day we interact with the cloud—whether it's using Google Drive, apps like Salesforce, or accessing our favorite websites. Cloud computing has become the norm for many companies, but what exactly is the cloud and why is everyone rushing to adopt it? Designed for absolute novices, this course breaks down what the cloud is and explains terminology such as scalability, latency, and high-availability. You'll learn about the many advantages including ease of remote collaboration, how there are no hardware limitations, and reliable disaster recovery. You'll also discover the range of tools provided by major cloud providers such as Amazon Web Services (AWS), Microsoft Azure, and Google Cloud. By the end of this course, you'll be able to confidently explain how cloud tools can increase productivity and save money, as well as ask the right questions about how to optimize your use of cloud tools.",
                "provider": "Datacamp",
                "duration": "2:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/cloud-computing-for-everyone",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_377",
                "courseTitle": "Introduction to Data Visualization with Matplotlib",
                "Tech_Skill": "Matplotlib",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Matplotlib, Python",
                "outcomeLearning": "Visualizing data in plots and figures exposes the underlying patterns in the data and provides insights. Good visualizations also help you communicate your data to others, and are useful to data analysts and other consumers of the data. In this course, you will learn how to use Matplotlib, a powerful Python data visualization library. Matplotlib provides the building blocks to create rich visualizations of many different kinds of datasets. You will learn how to create visualizations for different kinds of data and how to customize, automate, and share these visualizations.",
                "provider": "Datacamp",
                "duration": "4:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-data-visualization-with-matplotlib",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            }
        ],
        "Exception": [
            {
                "lstSkill_Provider": "AI, API, Deep Learning, Machine Learning, NumPy, OpenCV, Pandas, Python, GitHub, NoSQL, Jupyter, RDBMS, Amazon Web Services (AWS), Google Cloud, Linux, Graph Database, C++, Scikit-learn, PySpark, Microsoft Azure, Matplotlib",
                "lstSkill_notProvider": "Beautiful Soup, CNN, Datalab, GANs, Google Colab, Kaggle, Keras, LSTM, Librosa, PIL, Pytorch, RNN, Regex, Seaborn, Tensorflow, NLTK, Cognitive Computing, Elastic Search, IBM BlueMix, Apache Solr"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    },
    "courses_offline": {
        "status": 400,
        "message": "no courses",
        "Course": [],
        "Exception": [
            {
                "job_offer": "Mobile Tester, Software Development Manager, Junior Data Analyst, Senior SQL Server Developer, Data Manager"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    }
}